# YOLOv8 custom configuration with dual backbones

# Parameters
nc: 80  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone_rgb:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] #0
  - [-1, 1, Conv, [128, 3, 2]] #1

backbone_thermal:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] #10
  - [-1, 1, Conv, [128, 3, 2]] #11
fusion:
  # [from, repeats, module, args]
  - [[1, 3], 1, Concat, [1]]  # 20


# backbone_rgb:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] #0
#   - [-1, 1, Conv, [128, 3, 2]] #1
#   - [-1, 3, C2f, [128, True]]  #2
#   - [-1, 1, Conv, [256, 3, 2]] #3
#   - [-1, 6, C2f, [256, True]]  #4
#   - [-1, 1, Conv, [512, 3, 2]] #5
#   - [-1, 6, C2f, [512, True]]  #6
#   - [-1, 1, Conv, [1024, 3, 2]] #7
#   - [-1, 3, C2f, [1024, True]] #8
#   - [-1, 1, SPPF, [1024, 5]]   #9

# backbone_thermal:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]] #10
#   - [-1, 1, Conv, [128, 3, 2]] #11
#   - [-1, 3, C2f, [128, True]]  #12
#   - [-1, 1, Conv, [256, 3, 2]] #13
#   - [-1, 6, C2f, [256, True]]  #14
#   - [-1, 1, Conv, [512, 3, 2]] #15
#   - [-1, 6, C2f, [512, True]]  #16
#   - [-1, 1, Conv, [1024, 3, 2]] #17
#   - [-1, 3, C2f, [1024, True]] #18
#   - [-1, 1, SPPF, [1024, 5]]   #19
# fusion:
#   # [from, repeats, module, args]
#   - [[6, 16], 1, Concat, [1]]  # 20
#   - [[4, 14], 1, Concat, [1]]  # 21
#   - [[9, 19], 1, Concat, [1]]  # 22

# # # YOLOv8.0n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #23
#   - [[-1, 6], 1, Concat, [1]] # cat backbone P4 
#   - [-1, 3, C2f, [512]] # 12

#   - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
#   - [[-1, 4], 1, Concat, [1]] # cat backbone P3
#   - [-1, 3, C2f, [256]] # 15 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 12], 1, Concat, [1]] # cat head P4
#   - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 9], 1, Concat, [1]] # cat head P5
#   - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

#   - [[28, 31, 34], 1, Detect, [nc]] # Detect(P3, P4, P5)
